app/controllers/cines_controller.rb

SELECT nombre, external_id FROM `cines`
---
  def all

    doc = Nokogiri::HTML(open("http://www.bases123.com.ar/eldia/cines/index.php"))

    @cines = doc.xpath('//select[@id="cine"]/option').map do |i|