app/controllers/cines_controller.rb

  def insertAll

  #  begin

      # tengo romper la abstraccion porque quiero que empiece el id siempre desde 1
      # si no bastaría con hacer Cine.delete_all
      #ActiveRecord::Base.connection.execute("truncate table #{'cines'}") # no funciono en postgres
      Cine.delete_all
      Horario.delete_all

      doc = Nokogiri::HTML(open("http://www.bases123.com.ar/eldia/cines/index.php"))

      doc.xpath('//select[@id="cine"]/option').map do |info|
        Cine.create(:nombre => info.text, :external_id => info.xpath('@value').text)
      end

      # borro el primer registro porque dice simplemente "+ Cines"
      Cine.find(:first).destroy
---
DELETE FROM `cines` WHERE `cines`.`id` = 1
SELECT `cines`.* FROM `cines` LIMIT 1
INSERT INTO `cines` (`country`, `created_at`, `direccion`, `external_id`, `lat`, `localidad`, `long`, `nombre`, `query`, `tel`, `updated_at`, `zona_id`) VALUES (NULL, '2012-02-08 22:10:38', NULL, 0, NULL, NULL, NULL, '+ Cine', NULL, NULL, '2012-02-08 22:10:38', NULL)
SELECT `cines`.* FROM `cines` WHERE `cines`.`id` = 1 LIMIT 1