app/controllers/peliculas_controller.rb

SELECT id, titulo, brief, imagen FROM `peliculas` WHERE `peliculas`.`es_estreno` = 1
---
  def estrenos

    @movies = Pelicula.where(:es_estreno => true).select('id, titulo, brief, imagen')

DELETE FROM `peliculas`
SELECT `peliculas`.* FROM `peliculas`
INSERT INTO `peliculas` (`anio`, `calificacion`, `created_at`, `descripcion`, `director`, `duracion`, `estreno`, `external_id`, `fotografia`, `genero`, `guionista`, `imagen`, `interpretes`, `musica`, `pais`, `titulo`, `titulo_original`, `updated_at`, `web`) VALUES (NULL, NULL, '2012-02-11 03:58:46', NULL, NULL, NULL, NULL, 4291, NULL, NULL, NULL, 'http://www.123info.com.ar/fotos/4291ch.jpg', NULL, NULL, NULL, 'Aballay, el hombre sin miedo', NULL, '2012-02-11 03:58:46', NULL)
SELECT `peliculas`.* FROM `peliculas` WHERE `peliculas`.`id` = 1 LIMIT 1
---
  def insertAll

    Pelicula.delete_all

    doc = Nokogiri::HTML(open("http://cartelera.terra.com.ar/carteleracine/"))
    #//*[@id="tabla_en_cartelera"]
    doc.xpath('//div[@id="encartel"]/table/tbody/tr').map do |info|

      pelicula_link = info.xpath("td[@class='pelicula']/a/@href").text.split('/').to_a
      # saco el 1 misterioso, para que el id vuelva a la normalidad
      pelicula_id = pelicula_link[pelicula_link.count - 1].chop

      Pelicula.create(:titulo => info.xpath('td[@class="pelicula"]/a').text,
        :external_id => pelicula_id,
        :imagen => 'http://www.123info.com.ar/fotos/' + pelicula_id + 'ch.jpg')

    end

    # Argrego el detalle de cada pelicula
    peliculas = Pelicula.all
    peliculas.each do |pelicula|

      doc = Nokogiri::HTML(open("http://www.bases123.com.ar/eldia/cines/pelicula.php?id=" + pelicula.external_id.to_s))

      doc.xpath('/html/body/div/table').map do |info|

        p = Pelicula.find(pelicula.id)

INSERT INTO `peliculas` (`anio`, `brief`, `calificacion`, `created_at`, `descripcion`, `director`, `duracion`, `es_estreno`, `estreno`, `external_id`, `fotografia`, `genero`, `guionista`, `imagen`, `interpretes`, `musica`, `pais`, `titulo`, `titulo_original`, `updated_at`, `web`) VALUES (NULL, 'Sergio va a regresar a Buenos Aires luego de vivir 6 años en España. Antes de volver, captura diversos momentos de la vida cotidiana de siete de... ', NULL, '2012-02-11 04:14:23', NULL, NULL, NULL, 1, NULL, 4586, NULL, NULL, NULL, 'http://www.123info.com.ar/fotos/4586ch.jpg', NULL, NULL, NULL, 'El exterior', NULL, '2012-02-11 04:14:23', NULL)
---
  def insertEstrenos

    doc = Nokogiri::HTML(open("http://www.bases123.com.ar/eldia/cines/index.php"))

    doc.xpath('/html/body/div/table/tr').map do |i|
      titulo = i.xpath('td/strong/a').text
      brief = i.xpath('td[@class="texto"]').text.gsub(/\[ver m\u00e1s\]|\n/,'').strip.sub(titulo,'')
      link = i.xpath('td/a/@href').text.split('=').to_a
      pelicula_id = link[1]

      Pelicula.create(:external_id => pelicula_id,
        :titulo => titulo,
        :brief => brief,
        :imagen => i.xpath('td/img/@src').text,
        :es_estreno => true
        )