app/controllers/peliculas_controller.rb

  def cartelera

    doc = Nokogiri::HTML(open("http://www.bases123.com.ar/eldia/cines/index.php"))

    @peliculas = doc.xpath('//select[@id="pelicula"]/option').map do |i|
---
SELECT id, titulo, descripcion, interpretes, imagen FROM `peliculas`